Dmivaka/STM32H7-ETH-LWIP/Src/main.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

/* Configure the peripherals common clocks */
  PeriphCommonClock_Config();

  /* USER CODE BEGIN SysInit */
  __HAL_RCC_D2SRAM1_CLK_ENABLE(); // have no idea how to do this from the CubeMX software.
  HAL_Delay(1000); // does not work without this line. I believe it's linked to lan8720 start-up time. 
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_TIM1_Init();
  MX_FDCAN1_Init();
  MX_FDCAN2_Init();
  MX_FDCAN3_Init();
  MX_LWIP_Init();
  MX_SPI1_Init();
  MX_SPI3_Init();
  MX_TIM7_Init();
  /* USER CODE BEGIN 2 */
  HAL_SPI_Receive_DMA(&hspi3, SPI_RX_body, 1024);
  
  for( int i = 0; i < 512; i++)
  {
    SPI_TX_buf[i] = i;
  }

  udp_client_connect();
  
  HAL_TIM_Base_Start_IT(&htim7); // enable microseconds timesource
  HAL_TIM_Base_Start_IT(&htim1);
  
  if (HAL_FDCAN_ActivateNotification(&hfdcan1, FDCAN_IT_TX_FIFO_EMPTY, FDCAN_TX_BUFFER0 | FDCAN_TX_BUFFER1 | FDCAN_TX_BUFFER2) != HAL_OK)
  {
    Error_Handler();
  }
  
  // Filter for messages from master to this dedicated device. 
  FDCAN_FilterTypeDef sFilterConfig;  
  sFilterConfig.IdType = FDCAN_EXTENDED_ID;
  sFilterConfig.FilterIndex = 0;
  sFilterConfig.FilterType = FDCAN_FILTER_RANGE;
  sFilterConfig.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
  sFilterConfig.FilterID1 = 0x0;
  sFilterConfig.FilterID2 = 0x1FFFFFFF;  
  
  // iterate over three CAN bus handles and enable their parameters
  for( int i = 0; i < 3; i++)
  {
    // choose one FDCAN Handle from the three available
    FDCAN_HandleTypeDef * FDCAN_Handle = FDCAN_Handles_Map[i];
    
    if( FDCAN_Handle != NULL )
    {
      // Configure CAN frames filtering 
      if( HAL_FDCAN_ConfigFilter(FDCAN_Handle, &sFilterConfig) != HAL_OK ){ Error_Handler(); }  
      
      // Configure global filter: Filter all remote frames with STD and EXT ID. Reject non matching frames with STD ID and EXT ID
      if( HAL_FDCAN_ConfigGlobalFilter(FDCAN_Handle, FDCAN_REJECT, FDCAN_REJECT, FDCAN_FILTER_REMOTE, FDCAN_FILTER_REMOTE) != HAL_OK ){ Error_Handler(); }
      
      // Configure and enable Tx Delay Compensation, required for BRS mode.
      if( HAL_FDCAN_ConfigTxDelayCompensation(FDCAN_Handle, 5, 0) != HAL_OK){ Error_Handler(); }
      if( HAL_FDCAN_EnableTxDelayCompensation(FDCAN_Handle) != HAL_OK){ Error_Handler(); }
      
      // Activate Rx FIFO 0 new message notification
      //if( HAL_FDCAN_ActivateNotification(FDCAN_Handle, FDCAN_IT_RX_FIFO0_NEW_MESSAGE, 0) != HAL_OK ){ Error_Handler(); }      
      
      // Activate TX FIFO empty notification
      if( HAL_FDCAN_ActivateNotification( FDCAN_Handle, 
                                          FDCAN_IT_TX_FIFO_EMPTY, 
                                          FDCAN_TX_BUFFER0 | FDCAN_TX_BUFFER1 | FDCAN_TX_BUFFER2) != HAL_OK )
                                          { Error_Handler(); }

      // Start FDCAN periphery
      if( HAL_FDCAN_Start(FDCAN_Handle) != HAL_OK ){ Error_Handler(); }
    }
  }
  ///////////////////////////////////////////////////////////////////////////

  FDCAN_TxHeaderTypeDef TxHeader;
  uint8_t data[8] = {'a','b','c','d','e','f','g','h'};
  
  if (HAL_FDCAN_GetTxFifoFreeLevel(&hfdcan1) != 0)
  {
    // Add message to Tx FIFO 
    TxHeader.Identifier = 0x1;
    TxHeader.IdType = FDCAN_STANDARD_ID;
    TxHeader.TxFrameType = FDCAN_DATA_FRAME;
    TxHeader.DataLength = FDCAN_DLC_BYTES_8;
    TxHeader.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
    TxHeader.BitRateSwitch = FDCAN_BRS_ON;
    TxHeader.FDFormat = FDCAN_FD_CAN;
    TxHeader.TxEventFifoControl = FDCAN_STORE_TX_EVENTS;
    TxHeader.MessageMarker = 0x00;
    if (HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TxHeader, data) != HAL_OK)
    {
      Error_Handler();
    }
  }
  else
  {

  }
  
  CanardRxSubscription heartbeat_msg_subscription;
  if( canardRxSubscribe(        &canard,
                                CanardTransferKindMessage,
                                uavcan_node_Heartbeat_1_0_FIXED_PORT_ID_,
                                uavcan_node_Heartbeat_1_0_EXTENT_BYTES_,
                                CANARD_DEFAULT_TRANSFER_ID_TIMEOUT_USEC,
                                &heartbeat_msg_subscription) != 1 ){ Error_Handler(); }  

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  uint32_t timestamp = HAL_GetTick();
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    if( HAL_GetTick() > timestamp )
    {
      //LL_GPIO_SetOutputPin(GPIOD, LL_GPIO_PIN_6);
      //HAL_SPI_Transmit_DMA(&hspi1, SPI_TX_buf, 512);
      timestamp += 1000;
    }
    
    MX_LWIP_Process();
    
    /*
    if( gaga.bytes_written > 70 )
    {
      udp_client_send();
      __HAL_TIM_SET_COUNTER(&htim1, 0);
    }
    else if( timer_update_flag )
    {
      udp_client_send();
      timer_update_flag = 0;
    }
    */
    

    FDCAN_RxHeaderTypeDef RxHeader = {0};
    uint8_t RxData[64];
    
    while( HAL_FDCAN_GetRxFifoFillLevel(&hfdcan1, FDCAN_RX_FIFO0) > 0 )
    {
      if (HAL_FDCAN_GetRxMessage(&hfdcan1, FDCAN_RX_FIFO0, &RxHeader, RxData) != HAL_OK){ Error_Handler(); }
      write_can_frame(&FDCAN1_RX_buf, 0, &RxHeader, RxData);
    }
    
    while( HAL_FDCAN_GetRxFifoFillLevel(&hfdcan2, FDCAN_RX_FIFO0) > 0 )
    {
      if (HAL_FDCAN_GetRxMessage(&hfdcan2, FDCAN_RX_FIFO0, &RxHeader, RxData) != HAL_OK){ Error_Handler(); }
      write_can_frame(&FDCAN2_RX_buf, 1, &RxHeader, RxData);
    }

    while( HAL_FDCAN_GetRxFifoFillLevel(&hfdcan3, FDCAN_RX_FIFO0) > 0 )
    {
      if (HAL_FDCAN_GetRxMessage(&hfdcan3, FDCAN_RX_FIFO0, &RxHeader, RxData) != HAL_OK){ Error_Handler(); }
      write_can_frame(&FDCAN3_RX_buf, 2, &RxHeader, RxData);
    }

    /// processing of the received FDCAN frames from companion (via SPI) chip
    while( SPI_RX_buf.bytes_written > 0 )
    {
      uint8_t local_buffer[69] = {0};
      uint8_t frame_length = 0;
      
