Dmivaka/STM32H7-ETH-LWIP/Src/main.c
    // this code can be interrupted only by other CAN periph blocks so no need of critical section. 
    if( read_buffer(TX_buffer, local_buffer, full_frame_length) )
    {
      return ;
    }

    if( push_can_frame(hfdcan, local_buffer, full_frame_length) == 1 )
    {
      Error_Handler();
    }
    
    free_level = HAL_FDCAN_GetTxFifoFreeLevel(hfdcan);
  }
  
  return ;
}

// push VB CAN frame into CAN FIFO
uint8_t push_can_frame( FDCAN_HandleTypeDef *handle, uint8_t *frame_data, uint8_t frame_full_size)
{
  uint32_t bus_id = 0;
  memcpy(&bus_id, &frame_data[1], 4);

  uint8_t bus_num = decode_bus_num( bus_id );
  uint32_t id = decode_can_id( bus_id );    

  if (HAL_FDCAN_GetTxFifoFreeLevel(handle) != 0)
  {
    FDCAN_TxHeaderTypeDef TxHeader;
    // Add message to Tx FIFO 
    TxHeader.Identifier = id;
    TxHeader.IdType = FDCAN_STANDARD_ID;
    TxHeader.TxFrameType = FDCAN_DATA_FRAME;
    TxHeader.DataLength = LengthCoder( frame_full_size - 5 );
    TxHeader.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
    TxHeader.BitRateSwitch = FDCAN_BRS_ON;
    TxHeader.FDFormat = FDCAN_FD_CAN;
    TxHeader.TxEventFifoControl = FDCAN_STORE_TX_EVENTS;
    TxHeader.MessageMarker = 0x00;
    if (HAL_FDCAN_AddMessageToTxFifoQ(handle, &TxHeader, &frame_data[5]) != HAL_OK)
    {
      Error_Handler();
    }
    HAL_Delay(10);
  }
  else
  {
    return 1;
  }
  
  return 0;
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
  if( hspi->Instance == SPI1 )
  {
    send_frame_SPI();
  }
}

// push VB CAN frame into CAN FIFO
uint8_t send_frame_SPI(void)
{
  if( !LL_SPI_IsActiveMasterTransfer(SPI1) )
  {
    buffer_instance *s = &companion_TX_ins;

    if( s->bytes_written > 0 )
    {
      uint8_t frame_length = s->buffer_body[s->head]; // get the frame length, it's located at the beginning of new frame in the buffer
      if( frame_length > s->bytes_written )
      {
        // buffer is corrupted
        Error_Handler();
      }
      
      /*
      if( frame_length != 13 )
      {
        Error_Handler();
      }
      */
      
      read_buffer( s, SPI_TX_buf, frame_length);
      
      LL_GPIO_SetOutputPin(GPIOD, LL_GPIO_PIN_6);
      HAL_SPI_Transmit_DMA(&hspi1, SPI_TX_buf, frame_length);      
    }
  }
  
  return 0;
}

uint8_t write_can_frame(buffer_instance * s, uint8_t src_bus, FDCAN_RxHeaderTypeDef * head, uint8_t *data)
{
  uint8_t can_message_length = LengthDecoder( head->DataLength ) + 5; // together with service bytes
  
  write_buffer(s, &can_message_length, 1); // write message length
  
  can_message_length -= 5; // 25 bytes with the service info

  uint32_t id = head->Identifier;
  uint32_t bus_id = encode_bus_id( src_bus, id );

  write_buffer(s, (uint8_t*)&bus_id, 4); // write message length
  write_buffer(s, data, can_message_length); // write message length
  
  return 0;
}

uint8_t read_can_frame(buffer_instance * s, FDCAN_TxHeaderTypeDef * head, uint8_t *data)
{
  uint8_t can_message_length = 0;
  uint32_t bus_id = 0;
  uint8_t bus = 0;
  uint32_t id = 0;
  
  read_buffer(s, &can_message_length, 1);
  can_message_length -= 5;
  read_buffer(s, (uint8_t *)&bus_id, 4);
  read_buffer(s, data, can_message_length);

  head->DataLength = LengthCoder( can_message_length );
  head->Identifier = decode_can_id( bus_id );
  // process can frame
  
  return 0;
}

// allocate dynamic memory of desired size in bytes
static void *memAllocate(CanardInstance *const canard, const size_t amount)
{
  (void)canard;
  return malloc(amount);
}

// free allocated memory
static void memFree(CanardInstance *const canard, void *const pointer)
{
  (void)canard;
  free(pointer);
}
/* USER CODE END 4 */

/* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0x0;
  MPU_InitStruct.Size = MPU_REGION_SIZE_4GB;
  MPU_InitStruct.SubRegionDisable = 0x87;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.AccessPermission = MPU_REGION_NO_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.BaseAddress = 0x30000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_1KB;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER2;
  MPU_InitStruct.BaseAddress = 0x30004000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_16KB;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);
  /* Enables the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
